{"id":2,"name":"Archery","passives":[{"name":"Fleetfooted","description":"Taking damage for at least 10% of your Maximum Health within 2 seconds will increase your Movement Speed by 30% for 3 seconds. This effect can occur once every 20 seconds."},{"name":"Clever Adaptation","description":"Whenever you deal damage to a target, if it is 4 or more tiles away from you, deals extra 15.0% (Weapon Power) weapon damage. However, if the target is 3 or less tiles away from you, increases the effectiveness of your slows and snares by 30%."},{"name":"Clear Focus","description":"Every 5th basic attack on the same target restores 10 Aether. Clear Focus lasts for 10 seconds. Every subsequent stack will refresh the duration. "},{"name":"Careful Aim","description":"Your attacks to targets with 80% or more health deal 20% more damage."},{"name":"Marked for Death","description":"Your attacks apply Marked for Death to the target, reducing target's (Defense Power) by 0.35% for 6 seconds, up to 15 stacks. Every subsequent stack will refresh the duration. Upon reaching 15 stacks, the (Defense Power) reduction is doubled for 6 seconds, stacks will be reset when this effect ends. This effect can be applied once every 1.2 seconds."},{"name":"Blitz","description":"Whenever you deal damage, you have a 10% chance to increase your haste by 30% for 6 seconds. "}],"spells":[{"id":1,"cost":3,"name":"Precision Shot","cooldown":30,"channeling":true,"range":6,"description":"Channels for 2.5 seconds to shoot a powerful arrow. Deals 300.0% (Weapon Power) weapon damage to the target. Casting time is reduced by 0.5 seconds per 10 Aether consumed.","mana":"5%","ravencards":[{"id":79,"name":"brotherhood marksman","description":"Precision Shot (Spell) ignores 12.0% (Defense Power) of the target per 25 Aether consumed.","base":0,"increment":0},{"id":80,"name":"iceforge hunter","description":"Precision Shot (Spell) doesn't reduce its casting time per Aether consumed anymore. Precision Shot (Spell) has 2 charges and increases its critical damage by 17.0% per 25 Aether consumed instead.","base":0,"increment":0}]},{"id":10,"cost":1,"name":"Wind Arrow","cooldown":1,"channeling":false,"range":6,"description":"Shoots an arrow that deals 85.0% (Weapon Power) weapon damage to the target. Every third Wind Arrow (Spell) fires an additional Wind Arrow at 50% damage.","mana":"1%","ravencards":[{"id":73,"name":"saurian monitor","description":"Wind Arrow (Spell) has a 7.0% chance to reduce Precision Shot (Spell) and Quick Fire (Spell) remaining cooldown by 2 seconds. ","base":0,"increment":0},{"id":74,"name":"iceforge stormgunner","description":"Increases the damage of Wind Arrow (Spell) equal to 40.0% of your haste.","base":0,"increment":0}]},{"id":5,"cost":4,"name":"Dawn Arrow","cooldown":45,"channeling":false,"range":6,"description":"Shoots an arrow in a small area. Targets in the affected area will become Blinded and Confused for 2.5 seconds. ","mana":"6%","ravencards":[{"id":87,"name":"morningstar hermit","description":"Dawn Arrow (Spell) can heal ally targets in the affected area by 240.0% (Healing Power) health. ","base":0,"increment":0},{"id":88,"name":"sandwatcher jackal","description":"Dawn Arrow (Spell) enhances your next 8 basic attacks with sun arrows for 20 seconds. Sun Arrows deal additional 30.0% (Spell Power) spell damage to the target.","base":0,"increment":0}]},{"id":8,"cost":3,"name":"Snaring Shot","cooldown":30,"channeling":false,"range":6,"description":"Shoots an arrow that deals 50.0% (Weapon Power) weapon damage, applying snare to target for 2 seconds. The duration of the snare is doubled if the target is a creature.","mana":"6%","ravencards":[{"id":83,"name":"frostrisen shardshooter","description":"Snaring Shot (Spell) increases the critical chance of your next Precision Shot (Spell) or Quick Fire (Spell) by 7.0%. ","base":0,"increment":0},{"id":84,"name":"spearhog","description":"Snaring Shot (Spell) now increases the amount of damage Viper Arrow (Spell) deals for the remaining of Viper Arrow (Spell) duration by 30.0%. ","base":0,"increment":0}]},{"id":9,"cost":2,"name":"Viper Arrow","cooldown":20,"channeling":false,"range":6,"description":"Shoots an arrow that deals 60.0% (Weapon Power) weapon damage to the target and applies Poison that deals 5.0% (Weapon Power) weapon damage per second for 8 seconds. Poison damage is increased by 5.0% (Weapon Power) weapon damage per 10 Aether consumed.","mana":"3%","ravencards":[{"id":75,"name":"poisonpetal lotus","description":"Viper Arrow (Spell) deals (Spell Power) spell damage with 110.0% effectiveness.","base":0,"increment":0},{"id":76,"name":"giant bee","description":"Viper Arrows (Spell) damage over time is increased 6.0% each tick.","base":0,"increment":0}]},{"id":111,"cost":5,"name":"Spirit Rangers","cooldown":90,"channeling":true,"range":6,"description":"Shoots nine arrows over 2 seconds, each arrow hitting the target and dealing 50.0% (Weapon Power) weapon damage. ","mana":"16%","ravencards":[{"id":93,"name":"winterborn hunter","description":"Spirit Rangers (Spell) increases your and 2 allies' haste by 18.0% for 8 seconds.","base":0,"increment":0},{"id":94,"name":"skeleton archer","description":"If the target is affected by any reduction of (Defense Power), Spirit Rangers (Spell) deals additional 12.0% (Weapon Power) weapon damage to it.","base":0,"increment":0}]},{"id":3,"cost":5,"name":"Dragons Arrow","cooldown":45,"channeling":false,"range":6,"description":"Shoots an arrow that causes the target to burn, dealing 80.0% (Weapon Power) weapon damage per second for 4 seconds. Creates a burning ground between you and the target applying the same effect to enemies crossing it and slowing them by 20%. Cooldown is reduced by 3 seconds per 10 Aether consumed.","mana":"10%","ravencards":[{"id":91,"name":"draconic crusader","description":"Targets that stand on burning ground affected by the Dragons Arrow (Spell) receive a (Defense Power) reduction based on 6.5% of your (Weapon Power) for 6 seconds. ","base":0,"increment":0},{"id":92,"name":"minotaur arbalist","description":"Applies an additional slow of 12.0%. The slow lasts for 4 seconds regardless of whether the target is on top of burning ground or not.","base":0,"increment":0}]},{"id":6,"cost":4,"name":"Rain Of Arrows","cooldown":45,"channeling":true,"range":6,"description":"Shoots a rain of arrows in a medium area for 2 seconds, each arrow dealing 25.0% (Weapon Power) weapon damage and slowing enemies hit by 30%, for 1 second. The shooting duration increases 0.5 seconds per 10 Aether consumed.","mana":"12%","ravencards":[{"id":85,"name":"ghaz archer","description":"Rain of Arrows (Spell) shoots fire arrows that will make enemies burn for 12.0% (Weapon Power) Weapon Damage for 5 seconds. ","base":0,"increment":0},{"id":86,"name":"yornish hunter","description":"Rain of Arrows (Spell) shoots ice arrows, applying an additional slow of 14.0% to targets inside the area.","base":0,"increment":0}]},{"id":4,"cost":3,"name":"Disengage","cooldown":60,"channeling":false,"range":6,"description":"Shoots an arrow that deals 100.0% (Weapon Power) weapon damage. It knocks you back by 2 tiles and the target by 3 tiles while slowing the target by 50% for 1.5 seconds.","mana":"5%","ravencards":[{"id":89,"name":"elf bowman","description":"Disengage (Spell) increases your speed by 14.0% for 3 seconds. ","base":0,"increment":0},{"id":90,"name":"captain boone","description":"Disengage (Spell) reduces the cooldown of Precision Shot (Spell) by 6.0 seconds. ","base":0,"increment":0}]},{"id":112,"cost":4,"name":"Venom Grenade","cooldown":60,"channeling":false,"range":6,"description":"Throws a venom grenade in a small area, dealing 20.0% (Weapon Power) weapon damage per second for 6 seconds. Affected targets are slowed by 30% and their received healing is reduced by 30% for 6 seconds. ","mana":"14%","ravencards":[{"id":95,"name":"poisonpetal goliath","description":"Venom Grenade (Spell) also increases targets' skill mana cost by 30.0% for 6 seconds. ","base":0,"increment":0},{"id":96,"name":"hookmask slinger","description":"Decreases Venom Grenade (Spell) cooldown by 20 seconds and effect duration by 4 seconds. Increases the slow and anti-heal effectiveness by 72.0%. ","base":0,"increment":0}]},{"id":2,"cost":2,"name":"Concussive Shot","cooldown":25,"channeling":false,"range":6,"description":"Shoots an arrow that deals 75.0% (Weapon Power) weapon damage and slows the target by 20% for 4 seconds. Increases slow by 5% per 10 Aether consumed.","mana":"3%","ravencards":[{"id":77,"name":"pirate cannoneer","description":"Concussive Shot (Spell) generates 20 Aether instead. Applying confusion for 1.8 seconds. ","base":0,"increment":0},{"id":78,"name":"dwarf thunderer","description":"Concussive Shot (Spell) has 2 charges and generates 20 Aether, applying 18.0% slow to the target.","base":0,"increment":0}]},{"id":7,"cost":3,"name":"Quick Fire","cooldown":30,"channeling":true,"range":6,"description":"Shoots 3 arrows, each one dealing 55.0% (Weapon Power) weapon damage for 3 seconds. Shoots 1 additional arrow per 10 Aether consumed.","mana":"4%","ravencards":[{"id":81,"name":"brotherhood captain","description":"Decreases the remaining cooldown of Spirit Rangers (Spell) by 7.0 seconds. ","base":0,"increment":0},{"id":82,"name":"hoghound archer","description":"Increases Quick Fire (Spell) base critical chance by 12.0%. For every critical strike from Quick Fire (Spell), gain 3.6% haste and Movement Speed for 6 seconds. New stacks refresh the buff duration.","base":0,"increment":0}]}]}