{"id":6,"name":"Holy","passives":[{"name":"Sacred Spirit","description":"Healing skills on a target with under 30% health heal for 25% more."},{"name":"Prophet","description":"Whenever you cast healing skills, there is a 20% chance to reduce the mana cost of the next healing skills by 50% for the next 4 seconds."},{"name":"Invigorated Healing","description":"Doubles the base critical chance for healing spells."},{"name":"Healing Attunement","description":"Targetable heals cast on other players cost 60% less mana."},{"name":"Healing Bond","description":"When you heal a target, you are also healed for 10% of that amount."},{"name":"Devout Healer","description":"Increases your (Healing Power) by 25% but at the cost of 10% (Weapon Power) and (Spell Power).  You can't learn this skill if you already learned The Cost of Restoration. "}],"spells":[{"id":76,"cost":2,"name":"Dawn's Light","cooldown":10,"channeling":true,"range":6,"description":"Heals the target for 300.0% (Healing Power) health. Increases healing by 40.0% (Healing Power) per 10 Aether consumed.","mana":"22%","ravencards":[{"id":103,"name":"morningstar bishop","description":"Dawn's Light (Spell) now deals 30.0% of the amount healed as damage to the target's adjacent tiles. ","base":0,"increment":0},{"id":104,"name":"vampire reaver","description":"Increases the critical chance of Dawn's Light (Spell) by 18.0% on targets below 50% health.","base":0,"increment":0}]},{"id":75,"cost":3,"name":"Holy Force","cooldown":30,"channeling":true,"range":6,"description":"Deals 200.0% (Spell Power) spell damage on the target. Increases damage by 50.0% (Spell Power) per 10 Aether consumed.","mana":"10%","ravencards":[{"id":111,"name":"bloodthirsty kaiman","description":"Holy Force (Spell) consecrates the ground in a small area around the target, leaving it burning with holy fire dealing  12.0% (Spell Power) spell damage for 10 seconds. ","base":0,"increment":0},{"id":112,"name":"saurian sungazer","description":"Holy Force (Spell) now stuns the target for 1.7 seconds. ","base":0,"increment":0}]},{"id":77,"cost":2,"name":"Holy Shackles","cooldown":20,"channeling":true,"range":6,"description":"Slows the enemy for 20% and snares it for 0.5 seconds and deals 40.0% (Spell Power) spell damage per second for 2.5 seconds. The duration of the slow is increased by 0.5 second and the duration of the snare is increased by 0.3 seconds per 10 Aether consumed.","mana":"3%","ravencards":[{"id":105,"name":"dwarf warpriest","description":"Holy Shackles (Spell) is now an instant cast skill. Its applied slow is increased by 30.0%. ","base":0,"increment":0},{"id":106,"name":"morningstar flagellant","description":"Targets affected by Holy Shackles (Spell) receive 12.0% increased damage from your Smite (Spell) and Holy Force (Spell). ","base":0,"increment":0}]},{"id":71,"cost":4,"name":"Circle Of Light","cooldown":45,"channeling":true,"range":6,"description":"Heals you and party members inside a medium area for 75.0% (Healing Power) health per second over 5 seconds.  Increases healing by 15.0% (Healing Power) for every 10 Aether consumed.","mana":"28%","ravencards":[{"id":113,"name":"morningfox ninetails","description":"Circle of Light (Spell) doesn't require channeling anymore. Its healing effectiveness is reduced to 48.0%. ","base":0,"increment":0},{"id":114,"name":"golden guardian","description":"Circle of Light (Spell) applies Mend (Spell) to targets inside its area for 7.0 seconds. ","base":0,"increment":0}]},{"id":74,"cost":3,"name":"Healing Channel","cooldown":25,"channeling":true,"range":6,"description":"Focuses on a target for 1 second, healing it by 130.0% (Healing Power) health every 0.5 seconds. The duration is increased by 0.5 seconds per 10 Aether consumed.","mana":"28%","ravencards":[{"id":107,"name":"boro'gorom","description":"Healing Channel (Spell) can now be cast while moving. Slows your Movement Speed by 50.0% while channeling.","base":0,"increment":0},{"id":108,"name":"dwarf mechanic","description":"Healing Channel (Spell) increases (Defense Power) of the affected target by 18.0%. This effect can't occur again for 10 seconds on the same target.","base":0,"increment":0}]},{"id":99,"cost":4,"name":"Purify","cooldown":2,"channeling":false,"range":6,"description":"Removes 2 random harmful effects from the target, applying Weakened Spirit for 8 seconds. Weakened Spirit prevents target from being affected by Purify again.","mana":"12%","ravencards":[{"id":117,"name":"toadstool shaman","description":"Heals the target player by 65.0% (Healing Power) for each harmful skill effect removed from the target.","base":0,"increment":0},{"id":118,"name":"kaiman illusionist","description":"For each harmful effect removed, applies a Salvation for 10 seconds. Salvation heals the target for {%.1f%% (Healing Power) health. ","base":0,"increment":0}]},{"id":79,"cost":2,"name":"Mend","cooldown":15,"channeling":false,"range":6,"description":"Heals the target for 20.0% (Healing Power) health per second over 10 seconds. Increases healing by 6.0% (Healing Power) per 10 Aether consumed.","mana":"18%","ravencards":[{"id":101,"name":"brotherhood mender","description":"Increases the healing effect of Mend (Spell) on targets below 30% health by 25.0%. ","base":0,"increment":0},{"id":102,"name":"animated bones","description":"Every time Mend (Spell) heals a target, there is a 3.0% chance that Dawn's Light (Spell) goes off cooldown and costs no mana for the next 10 seconds. ","base":0,"increment":0}]},{"id":80,"cost":1,"name":"Smite","cooldown":1,"channeling":false,"range":6,"description":"Deals 90.0% (Spell Power) spell damage to the target. Every third Smite (Spell) will deal 30% additional damage.","mana":"1%","ravencards":[{"id":99,"name":"high elf champion","description":"Casting Smite (Spell) increases the critical chance of your next healing skill by 3.0%. This effect can stack up to 3 times and lasts for 15 seconds. ","base":0,"increment":0},{"id":100,"name":"sunchaser jackal","description":"Casting Smite (Spell) has a 7.0% chance to reset Holy Force (Spell) cooldown. This effect can occur once every 30 seconds. ","base":0,"increment":0}]},{"id":72,"cost":3,"name":"Devotion","cooldown":18,"channeling":false,"range":6,"description":"Heals the target for 325.0% (Healing Power) health.","mana":"22%","ravencards":[{"id":109,"name":"hierophant sigrid","description":"Devotion (Spell) increases your critical chance for your next healing skill by 18.0%. ","base":0,"increment":0},{"id":110,"name":"kaiman seer","description":"Devotion (Spell) now cleanses 1 harmful effect from the target and there is a 60.0% chance to cleanse an additional one.","base":0,"increment":0}]},{"id":78,"cost":6,"name":"Living Saint","cooldown":120,"channeling":false,"range":1,"description":"Increases (Defense Power) and (Healing Power) by 50% for 12 seconds. ","mana":"15%","ravencards":[{"id":119,"name":"phoenix","description":"While Living Saint (Spell) is active, Flash Heal (Spell) and Dawn's Light (Spell) cast become instant cast skills and heal for 9.0% more.","base":0,"increment":0},{"id":120,"name":"high elf priestess","description":"Increases healing critical chance by 17.5% and critical healing effectiveness by 30.0%. ","base":0,"increment":0}]},{"id":73,"cost":1,"name":"Flash Heal","cooldown":1,"channeling":true,"range":6,"description":"Heals the target for 170.0% (Healing Power) health. Every third Flash Heal (Spell) heals a bonus 50.0% (Healing Power) health to the target and becomes an instant cast.","mana":"10%","ravencards":[{"id":97,"name":"yornish druid","description":"Increases the healing of Flash Heal (Spell) on targets affected by Mend (Spell) by 18.0%. ","base":0,"increment":0},{"id":98,"name":"morningstar paladin","description":"Flash Heal (Spell) increases the damage of your next Smite (Spell) and Holy Shackles (Spell) by 25.0%. This effect stacks up to 3 times and lasts for 10 seconds.","base":0,"increment":0}]},{"id":100,"cost":6,"name":"Generous Influence","cooldown":60,"channeling":false,"range":6,"description":"Heals a target for 400.0% (Healing Power) health. If used on yourself, increases healing done by 20% for 10 seconds. If used on somebody else, increases healing received by the target by 30%. Gain 10 Aether every 2 seconds for 10 seconds. ","mana":"26%","ravencards":[{"id":115,"name":"elderwood goliath","description":"Generous Influence (Spell) doesn't increase healing anymore, but its healing is increased by 72.0% multiplicative.","base":0,"increment":0},{"id":116,"name":"iceforge winterlord","description":"When casted on a target other than yourself, Generous Influence (Spell) heals you as well for 60.0% of the target's healed amount. Only you benefit from the increased healing buff. Additionally, all healing you or your target receive during Generous Influence (Spell) also heals the other for 30.0% of the healed amount. ","base":0,"increment":0}]}]}